Show / Hide Table of Contents
Class ConcreteCheckDetailingEc2
Check Detailing Ec2
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteCheckDetailing
ConcreteCheckDetailingEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteCheckDetailingEc2 : ConcreteCheckDetailing
Properties
Improve this Doc   View Source
CheckValueLongReinf
check value of longitudinal reinforcement
Declaration
public double CheckValueLongReinf { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CheckValueShearReinf
check value of shear reinforcement
Declaration
public double CheckValueShearReinf { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source